export const regions = [
    {
        value : "Не выбрано",
        code: "0"
    },
    {
        value: "Алтайский край",
        code: "22"
    },
    {
        value: "Амурская область",
        code: "28"
    },
    {
        value: "Архангельская область",
        code: "29"
    },
    {
        value: "Астраханская область",
        code: "30"
    },
    {
        value: "Белгородская область",
        code: "31"
    },
    {
        value: "Брянская область",
        code: "32"
    },
    {
        value: "Владимирская область",
        code: "33"
    },
    {
        value: "Волгоградская область",
        code: "34"
    },
    {
        value: "Вологодская область",
        code: "35"
    },
    {
        value: "Воронежская область",
        code: "36"
    },
    {
        value: "Еврейская автономная область",
        code: "79"
    },
    {
        value: "Забайкальский край",
        code: "75"
    },
    {
        value: "Ивановская область",
        code: "37"
    },
    {
        value: "Иркутская область",
        code: "38"
    },
    {
        value: "Кабардино-Балкарская Республика",
        code: "07"
    },
    {
        value: "Калининградская область",
        code: "39"
    },
    {
        value: "Калужская область",
        code: "40"
    },
    {
        value: "Камчатский край",
        code: "41"
    },
    {
        value: "Карачаево-Черкесская Республика",
        code: "09"
    },
    {
        value: "Кемеровская область",
        code: "42"
    },
    {
        value: "Кировская область",
        code: "43"
    },
    {
        value: "Костромская область",
        code: "44"
    },
    {
        value: "Краснодарский край",
        code: "23"
    },
    {
        value: "Красноярский край",
        code: "24"
    },
    {
        value: "Курганская область",
        code: "45"
    },
    {
        value: "Курская область",
        code: "46"
    },
    {
        value: "Ленинградская область",
        code: "47"
    },
    {
        value: "Липецкая область",
        code: "48"
    },
    {
        value: "Магаданская область",
        code: "49"
    },
    {
        value: "Московская область",
        code: "50"
    },
    {
        value: "Мурманская область",
        code: "51"
    },
    {
        value: "Ненецкий автономный округ",
        code: "83"
    },
    {
        value: "Нижегородская область",
        code: "52"
    },
    {
        value: "Новгородская область",
        code: "53"
    },
    {
        value: "Новосибирская область",
        code: "54"
    },
    {
        value: "Омская область",
        code: "55"
    },
    {
        value: "Оренбургская область",
        code: "56"
    },
    {
        value: "Орловская область",
        code: "57"
    },
    {
        value: "Пензенская область",
        code: "58"
    },
    {
        value: "Пермский край",
        code: "59"
    },
    {
        value: "Приморский край",
        code: "25"
    },
    {
        value: "Псковская область",
        code: "60"
    },
    {
        value: "Республика Адыгея",
        code: "01"
    },
    {
        value: "Республика Алтай",
        code: "04"
    },
    {
        value: "Республика Башкортостан",
        code: "02"
    },
    {
        value: "Республика Бурятия",
        code: "03"
    },
    {
        value: "Республика Дагестан",
        code: "05"
    },
    {
        value: "Республика Ингушетия",
        code: "06"
    },
    {
        value: "Республика Калмыкия",
        code: "08"
    },
    {
        value: "Республика Карелия",
        code: "10"
    },
    {
        value: "Республика Коми",
        code: "11"
    },
    {
        value: "Республика Крым",
        code: "91"
    },
    {
        value: "Республика Марий Эл",
        code: "12"
    },
    {
        value: "Республика Мордовия",
        code: "13"
    },
    {
        value: "Республика Саха (Якутия)",
        code: "14"
    },
    {
        value: "Республика Северная Осетия-Алания",
        code: "15"
    },
    {
        value: "Республика Татарстан",
        code: "16"
    },
    {
        value: "Республика Тыва",
        code: "17"
    },
    {
        value: "Республика Хакасия",
        code: "19"
    },
    {
        value: "Ростовская область",
        code: "61"
    },
    {
        value: "Рязанская область",
        code: "62"
    },
    {
        value: "Самарская область",
        code: "63"
    },
    {
        value: "Санкт-Петербург",
        code: "78"
    },
    {
        value: "Саратовская область",
        code: "64"
    },
    {
        value: "Сахалинская область",
        code: "65"
    },
    {
        value: "Свердловская область",
        code: "66"
    },
    {
        value: "Смоленская область",
        code: "67"
    },
    {
        value: "Ставропольский край",
        code: "26"
    },
    {
        value: "Тамбовская область",
        code: "68"
    },
    {
        value: "Тверская область",
        code: "69"
    },
    {
        value: "Томская область",
        code: "70"
    },
    {
        value: "Тульская область",
        code: "71"
    },
    {
        value: "Тюменская область",
        code: "72"
    },
    {
        value: "Удмуртская Республика",
        code: "18"
    },
    {
        value: "Ульяновская область",
        code: "73"
    },
    {
        value: "Хабаровский край",
        code: "27"
    },
    {
        value: "Ханты-Мансийский автономный округ - Югра",
        code: "86"
    },
    {
        value: "Челябинская область",
        code: "74"
    },
    {
        value: "Чеченская Республика",
        code: "20"
    },
    {
        value: "Чувашская Республика",
        code: "21"
    },
    {
        value: "Чукотский автономный округ",
        code: "87"
    },
    {
        value: "Ямало-Ненецкий автономный округ",
        code: "89"
    },
    {
        value: "Ярославская область",
        code: "76"
    }
];

export const ammoniumNitrate = [
    { value: "Не выбрано" },
    { value: "10" },
    { value: "20" },
    { value: "30" },
    { value: "40" },
    { value: "50" },
    { value: "60" },
    { value: "70" },
    { value: "80" },
    { value: "90" },
    { value: "100" },
];

export const moisturevalues = [
    { value: 'Не выбрано' },
    { value: '200' },
    { value: '190' },
    { value: '180' },
    { value: '170' },
    { value: '160' },
    { value: '150' },
    { value: '140' },
    { value: '130' },
    { value: '120' },
    { value: '110' },
    { value: '100' },
    { value: '90' },
    { value: '80' },
];

export const nitrateNitrogen = [
    { value: "Не выбрано" },
    { value: "0" },
    { value: "20" },
    { value: "40" },
    { value: "60" },
    { value: "80" },
    { value: "100" },
    { value: "120" },
    { value: "140" },
    { value: "160" },
    { value: "180" },
    { value: "200" },
];

export const seedingRate = [
    { value: "Не выбрано" },
    { value: 2 },
    { value: 2.5 },
    { value: 3 },
    { value: 3.5 },
    { value: 4 },
    { value: 4.5 },
    { value: 5 },
    { value: 5.5 },
];

export const complexFertilizers = [
    { value: "Не выбрано" },
    { value: "35" },
    { value: "40" },
    { value: "45" },
    { value: "50" },
    { value: "55" },
    { value: "60" },
    { value: "65" },
    { value: "70" },
    { value: "75" },
    { value: "80" },
    { value: "85" },
    { value: "90" },
    { value: "95" },
    { value: "100" },
];

export default {regions, ammoniumNitrate,moisturevalues,nitrateNitrogen, seedingRate, complexFertilizers  };